export const timeIntervals = [
  {
    id: 0,
    type: 'музыка',
    points: {
      from: 1980, to: 1986,
    },
    pointName: '1',
    events:{
      1980: "Нью-Йорке состоялась прощальная вечеринка в честь закрытия диско-клуба «Студия 54»",
      1981: "1 августа начал вещание музыкальный канал MTV",
      1982: "Образовалась группа кино",
      1983: "На MTV состоялся премьерный показ четырнадцатиминутного экстравагантного клипа Майкла Джексона «Thriller».",
      1984: "В Лондоне состоялась премьера рок-мюзикла Эндрю Ллойд Уэббера «Звёздный Экспресс».",
      1985: "Образовалась группа Ария",
      1986: "Майкл Джексон выкупил авторские права на большинство песен «The Beatles» за 47 миллионов долларов",
    }
  },
  {
    id: 1,
    type: "кино",
    points: {
      from: 1987, to: 1991,
    },
    pointName: '2',
    events:{
      1987: "«Хищник»/Predator, США (реж. Джон Мактирнан)",
      1988: "«Кто подставил кролика Роджера»/Who Framed Roger Rabbit, США (реж. Роберт Земекис)",
      1989: "«Назад в будущее 2»/Back To The Future 2, США (реж. Роберт Земекис)",
      1990: "«Крепкий орешек 2»/Die Hard 2, США (реж. Ренни Харлин)",
      1991: "«Робин Гуд»/Robin Hood, Великобритания, (реж. Джон Ирвин)",
    }
  },
  {
    type: 'Литература',
    id: 2,
    points: {
      from: 1992, to: 1997,
    },
    pointName: '3',
    events: {
      1992: "Нобелевская премия по литературе — Дерек Уолкотт, «За блестящий образец карибского эпоса в 64 разделах»",
      1994: "«Бессонница» — роман Стивена Кинга",
      1995: "Нобелевская премия по литературе — Шеймас Хини, «За лирическую красоту и этическую глубину поэзии...»",
      1997: "«Гарри Поттер и философский камень» — роман Джоан Роулинг",
    }
  },
  {
    id: 3,
    points: {
      from: 1999, to: 2004,
    },
    pointName: '4',
    events: {
      1999: "Премьера балета «Золушка» в постановке Жан-Кристофа Майо, сценография Эрнеста Пиньона",
      2000: "Возобновлено издание журнала «Театр»",
      2002: "Возобновлено издание журнала «Театр»",
      2003: "В Венеции после восьмилетней реставрации постановкой оперы Джузеппе Верди «Травиата» открылся театр «Ла Фениче», пострадавший в пожаре 1996 года",
      2004: "2 октября в Московском драматическом театре им. А. С. Пушкина поставлен спектакль «Кот в сапогах» Ш.Перро",
    }
  },
  {
    id: 4,
    type: "Спорт",
    points: {
      from: 2006, to: 2014,
    },
    pointName: '5',
    events: {
      2006: "Баскетбольный клуб ЦСКА стал победителем национального первенства России",
      2008: "C 8 по 24 августа в Пекине прошли летние Олимпийские игры",
      2010: "13-28 февраля в Ванкувере: Зимние Олимпийские игры 2010 года",
      2012: "2 августа - Летние Олимпийские игры",
      2014: "XXII Зимние Олимпийские Игры (Сочи, Россия)",
    }
  },
  {
    id: 5,
    type: "наука",
    points: {
      from: 2015, to: 2022,
    },
    pointName: '6',
    events: {
      2015: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      2016: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      2017: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      2018: "Старт космического аппарата Solar Probe Plus, предназначенного для изучения Солнца",
      2019: "Google объявил о создании 53-кубитного квантового компьютера",
      2020: "Корабль Crew Dragon вернулся на Землю из первого пилотируемого полёта",
    }
  }
];